// Дана последовательность температурных колебаний: -25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
// Объединить эти значения в группы с шагом 10 градусов.
// Пример: -20:{-25.4, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20:{24.5}, 30:{32.5}.
// Пояснение: диапазон -20 включает значения от -20 до -29.9, диапазон 10 – от 10 до 19.9, и т.д.
// Порядок в подмножествах не важен.

package main

import (
	"fmt"
)

func main() {
	array := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5, 19.95, 19.9}

	tempGroup := make(map[int][]float64)

	for i := range array {
		key := int(array[i]) / 10 * 10

		// если 19.95 включается в след диапозон
		// if array[i] < 0 {
		// 	if float64(key)-array[i] > 9.9 {
		// 		key -= 10
		// 	}
		// } else {
		// 	if float64(key)-array[i] < -9.9 {
		// 		key += 10
		// 	}
		// }

		tempGroup[key] = append(tempGroup[key], array[i])
	}

	fmt.Println(tempGroup)
}
